app/controllers/admin/testimonials_controller.rb

  def show
    @Testimonial = Testimonial.find(params[:id])
---
SELECT * FROM `testimonials` WHERE (`testimonials`.`id` = 1)

  def create
    @Testimonial = Testimonial.create(params[:testimonial])
---
INSERT INTO `testimonials` (`name`, `position`, `company`, `created_at`, `updated_at`, `published`) VALUES('teste', 'teste', 'teste', '2010-10-04 19:54:44', '2010-10-04 19:54:44', 1)

  def edit
    @Testimonial = Testimonial.find(params[:id])
---
SELECT * FROM `testimonials` WHERE (`testimonials`.`id` = 1)

  def update
    @Testimonial = Testimonial.find(params[:id])
    @Testimonial.attributes = params[:testimonial]

    if @Testimonial.save
---
SELECT * FROM `testimonials` WHERE (`testimonials`.`id` = 1)
UPDATE `testimonials` SET `updated_at` = '2010-10-04 20:12:14', `name` = 'teste', `testimonial` = '<p>&ccedil;&ccedil;&ccedil;&ccedil;&ccedil;&ccedil;&ccedil;&ccedil;&ccedil;&ccedil;&ccedil;&ccedil;</p>' WHERE `id` = 1